#include <stdio.h>
#include <string.h> // strncpy memcpy

/*
*
|------------------------------------------------|------------------------------------------------|
|            strncpy                             |                      memcpy                    |
|------------------------------------------------|------------------------------------------------|
| strncpy() 复制字符串,遇到 \0 结束,不会复制剩余空间。 | memcpy() 会复制全部指定长度的字节数。               |
|------------------------------------------------|------------------------------------------------|
| strncpy() 不会在末尾添加 \0。                     | memcpy() 完全不处理 \0。                         |
| 如果源字符串比目标缓冲区短,则不会在目标缓冲区填充 \0   |                                                |
|------------------------------------------------|------------------------------------------------|
| strncpy() 更安全,避免缓冲区溢出                   |  memcpy() 如果指定的拷贝长度超过目标缓冲区,会造成溢出。|
|------------------------------------------------|------------------------------------------------|
| strncpy() 语义更清晰,专门操作字符串。              |  memcpy() 更底层,适合任意字节的拷贝操作             |
|------------------------------------------------|------------------------------------------------|
*
*/
void strncpy_test() {
    printf("[%s]\r\n", __func__);
    char *str = "s\0n";
    char buf[8] = {0};
    strncpy(buf, str, sizeof(buf));

    printf("buf:%s\r\n", buf);
}

void memcpy_test() {
    printf("[%s]\r\n", __func__);
    // char *str = "sn";
    char *str = "s\0n";
    char buf[8] = {0};

    memcpy(buf, str, sizeof(buf));

    // printf("buf:%s\r\n", buf);
    char *ptr = buf;
    for (int i = 0; i < 8; i++) {
        printf("%d%c ", i, ptr[i]);
    }
    printf("\r\n");
}

void test_app() {
    memcpy_test();
    strncpy_test();
}

int main() {
    test_app();
    return 0;
}
